{
  "blogs": [
    {
      "title": "Neeraja",
      "body": "The little things matter. Simple, thoughtful gestures are often those that get etched in our memory. Workplaces are no different. The more open you are to letting your co-workers know that they matter, the happier your workplace will be.\n\nOn this Employee Appreciation Day, it's important to understand that you don't need a specific day to celebrate the people that hold your business together; appreciation needs to be an integral part of your work culture. After all, we’re human and we get by with a little help, a nudge every now and then, to make us feel like we belong. Ultimately that's what great work cultures do: instill a sense of community or a sense of belonging amongst its employees. At the core of this is appreciation and gratitude.\n\nHow can you make employees feel appreciated? \n\nWhile monetary benefits remain paramount, here are a few considerate gestures to let employees know you value them.\n\nProvide employees a space to express themselves \n\nWhether it's sharing ideas, bonding over shared interests with coworkers, or being able to network with people across all hierarchies, make sure employees are given the freedom to communicate and be their genuine selves, whether it’s in hallway conversations or virtual interactions. Cultivating openness in communication helps create a secure environment for employees and lets them know that the organization trusts them.\n\nRecognize and reward employees \n\nDrop in a \"Good Job\" to a coworker who has given their first presentation, or a \"Thank you\" to a team member or manager who helped you out with closing a deal. Leave them a personalized note or simply use a platform like Connect to send kudos to one another. What better way to let someone know that you value them than recognizing and being grateful for who they are and what they do. \n\nBuild transparency and trust \n\nOne of the best ways to let employees know they're appreciated is to trust them and include them in company-level activities. Whether it's an award or a customer acquisition, celebrate the wins—both big and small—with all of your employees. Acknowledge birthdays, work anniversaries, and other milestones. You can share them on your employee communications platform to let everyone join in on the fun!\n\nValue employee feedback \n\nTrue appreciation goes beyond recognizing and rewarding people's contributions. Your employees will feel the most seen and heard when you start valuing their feedback. By conducting regular pulse surveys or holding Q&A sessions with them, you can understand how they perceive the organization, their grievances, and how to best address them in order to provide pleasant employee experiences.  \n\nFocus on employee well-being. \n\nAppreciation and well-being always go hand in hand. Be mindful of the amount of work that employees are made to handle. Allow them to prioritize their work-life balance, give them a water cooler space to engage in activities that aren’t about work—for example, an online book club, or meetings where coworkers can get together and play fun games like Pictionary. When your employees are happy and at peace at work, your organization is on the path to achieving the culture you've dreamed of.\n\nMany of these things may seem small, but they can go a long way in positively impacting your employees' relationship with the organization and, by extension, the experience your business provides to customers.\n\nSo don't hold back on the appreciation and the gratitude. If you need a little help to get you started, we have something for you.\n\nHappy Employee Appreciation Day!\nCelebrate each other, every day.\n\nWith gratitude,\nTeam Zoho Connect",
      "author": "Neeraja",
      "id": 1
    },
    {
      "title": "How often should we reset our passwords?",
      "body": "The concept of changing passwords often is not a new one. For decades, cybersecurity experts espoused the policy of changing passwords every two to three months. The primary reason to give credentials—not just passwords but any authentication credentials—an expiration date is to limit the amount of time a lost, stolen, or forged credential can be used by someone else. \n\nMisled cause for concern\nThe cause for concern arose from the mistaken belief that an attacker would lie passively, eavesdropping silently. The traditional theory believes that if passwords are frequently changed, such a passive attacker would be thwarted from having greater access.\n\nThis does not hold true for many reasons, including the simple fact that an attacker is not going to remain dormant. For example, a hacker with access to your banking credentials is not going to wait around; they will immediately transfer money out of your bank account and this will be noticeable. In such a situation, it does not make sense to change your credentials regularly, but it is of prime importance to change them as soon as possible after being made aware of the loss occurring.\n\nAnother drawback of frequently changing passwords is that it makes them harder to remember. Moreover, if regular password changes are enforced, people are more likely to choose passwords that are easier to remember and guess, than they would if they could use the same passwords for a longer duration. This also encourages people to use techniques such as writing passwords on sticky notes or in journals, leading to a greater risk of those passwords being lost or compromised.\n\nThe way forward\nAccording to NIST and NCSC guidelines, the best password reset duration is not to have one at all, but instead focus on changing passwords immediately after a breach and to use multifactor authentication (MFA) and password management services where available. These guidelines are based on sensible practices—you would not change the locks to your house every three months but you would when your house has been broken into.\n\nThere are certain situations where password reset durations are necessary for compliance with certain standards, such as ISO 27001 and NIST 800-53. In other cases, it would be useful to use password managers. With password managers you can generate passwords that are not easy to guess, can be saved, and can enforce a specific duration through password expiry.\n\nAnother good feature offered by password managers would be MFA, which works by using fundamentally different methods to prove your identity, usually with three classic factors: something you know (knowledge), something you have (possession), and something you are (inherence). Well-built MFAs use two or more of these unique factors such as a password (knowledge) plus a fingerprint (inherence), or a password (knowledge) plus a one-time password on a mobile app to prove possession of the phone.\n\nHaving multiple factors makes it tougher for attackers because a successful attack requires multiple venues of attack. This makes accounts safer where possible. Active monitoring of passwords that have been compromised in data breaches is another important feature. It makes sure that you are aware if any of your passwords are compromised in a data breach by any service you use.\n\nZoho Vault offers features intended to protect users. The built-in password generator allows you to generate passwords of any required complexity and automatically save them. Zoho Vault also has the option to set expiration alerts for those users who need to reset passwords periodically. Another feature offered is two-factor authentication in the form of temporary OTPs (TOTP) for passwords. Vault also has the opt-in feature for breached password detection; Vault keeps a lookout for any of your passwords that may have been compromised in password breaches.\n\nWhenever you have a breached password in your account, Vault will alert you to change or update that password. This alert banner will be visible until you reset the credentials. Additionally, through the dashboard, Vault lets you identify and remove weak and reused passwords from your account with customized security insights displayed on the dashboard.\n\nIf you are interested in learning more about how you or your organization can benefit from using a password manager, get in touch with our Zoho Vault experts for more product information and a demo.\n\nCategoriesZoho Vault",
      "author": "yoshi",
      "id": 2
    }
  ]
}